## Plan Result (cftptl - Job)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * azurerm_role_assignment.search_contributor_hmcts_way
  * azurerm_role_assignment.storage_blob_data_contributor_hmcts_way




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.search_contributor_hmcts_way must be replaced
-/+ resource "azurerm_role_assignment" "search_contributor_hmcts_way" {
      ~ id                                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Search/searchServices/platops-slack-help-bot-ptl/providers/Microsoft.Authorization/roleAssignments/a30c7a81-62a2-c15f-4552-3b9713bd1ee4" -> (known after apply)
      ~ name                                   = "a30c7a81-62a2-c15f-4552-3b9713bd1ee4" -> (known after apply)
      ~ principal_id                           = "29703cf0-15f5-411c-be38-425663df214b" -> "/servicePrincipals/29703cf0-15f5-411c-be38-425663df214b" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Authorization/roleDefinitions/7ca78c08-252a-4471-8644-bb5ff32d4ba0" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.storage_blob_data_contributor_hmcts_way must be replaced
-/+ resource "azurerm_role_assignment" "storage_blob_data_contributor_hmcts_way" {
      ~ id                                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/slack-help-bot-cftptl-intsvc-rg/providers/Microsoft.Storage/storageAccounts/platopslackhelpbotai/providers/Microsoft.Authorization/roleAssignments/61c8eb4e-58ea-2712-6f30-d6d86f81bbe6" -> (known after apply)
      ~ name                                   = "61c8eb4e-58ea-2712-6f30-d6d86f81bbe6" -> (known after apply)
      ~ principal_id                           = "29703cf0-15f5-411c-be38-425663df214b" -> "/servicePrincipals/29703cf0-15f5-411c-be38-425663df214b" # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":466,"Program":"tfcmt","SHA1":"","Target":"cftptl - Job","Vars":{}} -->